{"_id":{"$oid":"635961ecb2e4e7109ac44b9b"},"Name":"Michael Showalter","Birthyear":1970,"Bio":"Michael Showalter is an American comedian, actor, writer, and director. He is one third of the sketch comedy 'trio Stella'. Showalter first came to recognition as a cast member on MTV's 'The State', which aired from 1993 to 1995. He co-wrote (with David Wain) and starred in Wet Hot American Summer (2001) and he wrote, directed, and starred in 'The Baxter' (2005). Both of these movies featured many of his co-stars from 'The State', and so do several of his other projects.","Movies":[{"$oid":"6360104d73c203b32b8a77f4"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44b9c"},"Name":"Jordan Peele","Birthyear":1979,"Bio":"Jordan Peele, born in New York City, is an American comedian, writer, director, and producer who was known for creating both comedy and horror films and TV shows that address popular culture and social issues, especially race relations.In 2017, Peele was included on the annual Time 100 list of the most influential people in the world.","Movies":[{"$oid":"63596e55b2e4e7109ac44bbd"},{"$oid":"636010a173c203b32b8a77f7"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44b9d"},"Name":"Pete Docter","Birthyear":1968,"Bio":"Pete Docter is an American animator, screenwriter, producer, voice actor and an Oscar-winning director of 'Monsters, Inc.', 'Up', and 'Inside Out' – also Chief Creative Officer at Pixar Animation Studios. Starting at Pixar in 1990 as the studio's third animator, he animated and directed several commercials.","Movies":[{"$oid":"6360112673c203b32b8a77fa"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44b9f"},"Name":"Barry Jenkins","Birthyear":1979,"Bio":"Barry Jenkins is an American director, writer, and producer who was known for creating lyrical, empathetic films that centre on Black characters. Jenkins grew up in the economically distressed Liberty City neighbourhood of Miami.","Movies":[{"$oid":"63596e55b2e4e7109ac44bb7"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44ba0"},"Name":"Xavier Dolan","Birthyear":1989,"Bio":"Xavier Dolan is a Canadian actor, director, screenwriter, editor, costume designer, and voice actor. He began his career as a child actor in commercials before directing several arthouse feature films. He first received international acclaim in 2009 for his feature film directorial debut, 'I Killed My Mother', which premiered at the Cannes Film Festival in the Director's Fortnight section. Since 2009, he has written and directed eight feature films, most of them have premiered at Cannes. Dolan has won many awards for his work, including the Jury Prize at the 2014 Cannes Film Festival for 'Mommy' and the Grand Prix at the 2016 Cannes Film Festival for 'It's Only the End of the World'. He has also won several Canadian Screen Awards and César Awards.","Movies":[{"$oid":"63596e55b2e4e7109ac44bb8"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44ba1"},"Name":"Jennie Livingston","Birthyear":1962,"Bio":"Jennie Livingston is an American filmmaker living in New York, known for her lively storytelling, nuanced character portraits, and thoughtful explorations of identity, class, race, death, sex, and gender. She works in both fiction and nonfiction. Jennie's taught at Yale, Connecticut College, and Brooklyn College, lectured widely, written for national magazines, and appeared as a subject or speaker in a number of documentaries and cultural programs.","Movies":[{"$oid":"63596e55b2e4e7109ac44bb9"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44ba2"},"Name":"Sam Feder","Bio":"Sam Feder is a Peabody Award nominated film director. Cited by Indiewire as one of the 'exciting trans filmmakers shaking up Hollywood', Sam's films explore the intersection of visibility and politics along the lines of race, class, and gender. Sam's filmmaking practice models inclusion and equity in the industry.","Movies":[{"$oid":"63596e55b2e4e7109ac44bba"}]}
{"_id":{"$oid":"635961ecb2e4e7109ac44ba3"},"Name":"Rebecca Hall","Birthyear":1982,"Bio":"Rebecca Maria Hall is an English actress and filmmaker from London.She made her first onscreen appearance at age 10 in the 1992 television adaptation of The Camomile Lawn, directed by her father, Sir Peter Hall. In 2006, following her film debut in 'Starter for 10', Hall got her breakthrough role in Christopher Nolan's thriller film 'The Prestige'. In 2008, she starred as Vicky in Woody Allen's romantic comedy-drama 'Vicky Cristina Barcelona', for which she received a Golden Globe nomination for Best Actress. Hall then appeared in a wide array of films. She made her directorial debut with 'Passing' (2021), receiving critical acclaim.","Movies":[{"$oid":"63596e55b2e4e7109ac44bbc"}]}
{"_id":{"$oid":"635aa54bb2e4e7109ac44bc3"},"Name":"Julian Schnabel","Birthyear":1951,"Bio":"A key figure in the Neo-expressionist movement, American artist and filmmaker Julian Schnabel – born in Brooklyn – is known for his biographical films, as well as his paintings made from plate fragments, velvet, wood, and wax.","Movies":[{"$oid":"63596e55b2e4e7109ac44bb6"}]}
{"_id":{"$oid":"635ea842c193d56cb76a8a45"},"Name":"Theodore Melfi","YearOfBirth":1970,"Bio":"Writer, producer and filmmaker Ted Melfi – born in Brooklyn,NY – began his career helming over 100 commercials before branching out into short films and full-length features, eventually making his mark in Hollywood as the director of the Bill Murray-starring comedy 'St. Vincent' (2014). ","__v":0,"Movies":[{"$oid":"635ead68a6b13018ce5d9b3b"}]}
{"_id":{"$oid":"63600ef273c203b32b8a77ed"},"Name":"Ryan Coogler","YearOfBirth":1986,"Bio":"Ryan Kyle Coogler is an African-American filmmaker and producer who is from Oakland, California. He is known for directing the Black Panther film series, Creed, a Rocky spin-off and Fruitvale Station. He frequently casts Michael B. Jordan in his works.","__v":0,"Movies":[{"$oid":"63600f5d73c203b32b8a77f0"}]}
