{"_id":{"$oid":"635964e5b2e4e7109ac44ba4"},"Name":"Action","Description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots. They can feature superheroes, martial arts, or exciting stunts. These high-octane films are more about the execution of the plot rather than the plot itself. Action movies are thrilling to watch and leave audience members on the edge of their seats. Cop movies, disaster films, and some spy films fall under the action category.","Movies":[{"$oid":"63600f5d73c203b32b8a77f0"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44ba5"},"Name":"Adventure","Description":"The adventure genre is so similar to the action genre that the billing for adventure films is sometimes action/adventure movies. Films in the adventure genre usually contain the same basic genre elements as an action movie, with the setting as the critical difference. Adventure movies are typically set in an exotic, far away, or unfamiliar locale. This category can include swashbuckler films and survival films.","Movies":[{"$oid":"63600f5d73c203b32b8a77f0"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44ba6"},"Name":"Fantasy","Description":"Films in the fantasy genre feature magical and supernatural elements that do not exist in the real world. Although some films juxtapose a real-world setting with fantastical elements, many create entirely imaginary universes with their own laws, logic, and populations of imaginary races and creatures. Like science fiction films, fantasy films are speculative but unrelated to reality or scientific fact. High fantasy, fairy tales, and magical realism are all fantasy subgenres.","Movies":[{"$oid":"63600f5d73c203b32b8a77f0"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44ba7"},"Name":"Comedy","Description":"Comedy films are funny and entertaining. The films in this genre center around a comedic premise—usually putting someone in a challenging, amusing, or humorous situation they're not prepared to handle. Good comedy movies are less about making constant jokes and more about presenting a universally relatable, real-life story with complex characters who learn an important lesson. Mockumentary, dark comedy (or black comedy), romantic comedy, parody/spoof, and slapstick comedy are all examples of comedy subgenres.","Movies":[{"$oid":"6360112673c203b32b8a77fa"},{"$oid":"6360104d73c203b32b8a77f4"},{"$oid":"63596e55b2e4e7109ac44bb8"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44ba8"},"Name":"Romance","Description":"Romance films are love stories. They center around two protagonists exploring some of the elements of love like relationships, sacrifice, marriage, obsession, or destruction. Romance movies sometimes feature hardships like illness, infidelity, tragedy, or other obstacles for the love interests to overcome. Romantic comedies, gothic romance, and romantic action are some popular romance subgenres.","Movies":[{"$oid":"6360104d73c203b32b8a77f4"},{"$oid":"63596e55b2e4e7109ac44bb8"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44ba9"},"Name":"Horror","Description":"Horror films feature elements that leave people with an overwhelming sense of fear and dread. Horror movies often include serial killers or monsters as persistent, evil antagonists to play on viewers' fears or nightmares. Audiences who love the horror genre seek out these movies specifically for the adrenaline rush produced by ghosts, gore, monsters, and jump scares. Films that fall into the horror sub-genres include macabre, ghost stories, gothic horror movies, science fiction horror movies, supernatural movies, dark fantasy movies, psychological horror movies, and slasher movies.","Movies":[{"$oid":"636010a173c203b32b8a77f7"},{"$oid":"63596e55b2e4e7109ac44bbd"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44baa"},"Name":"Mystery","Description":"Mystery films are all about the puzzle and often feature a detective or amateur sleuth trying to solve it. Mystery films are full of suspense, and the protagonist searches for clues or evidence throughout the movie, piecing together events and interviewing suspects to solve the central question. Hardboiled noirs and police procedurals are two subcategories that often fall under the mystery genre.","Movies":[{"$oid":"636010a173c203b32b8a77f7"},{"$oid":"63596e55b2e4e7109ac44bbd"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44bab"},"Name":"Thriller","Description":"Thrillers expertly blend mystery, tension, and anticipation into one exciting story. Successful thrillers are well-paced, often introducing red herrings, divulging plot twists, and revealing information at the exact right moments to keep the audience intrigued. Thrillers often include a “ticking clock” aspect, where the stakes are against a finite amount of time. Crime films, political thrillers, and techno-thrillers are all featured in the thriller genre.","Movies":[{"$oid":"636010a173c203b32b8a77f7"},{"$oid":"63596e55b2e4e7109ac44bbd"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44bac"},"Name":"Animation","Description":"Animation is a technique in which animated characters are animated to look like moving pictures. In the past, in traditional animation, hand drawings are drawn or paintings on smooth celluloid sheets to create images and then printed on paper. These pictures are then drawn onto paper by using a brush. With the advent of computer-assisted animation, most animated movies today are created with computer-generated images.","Movies":[{"$oid":"6360112673c203b32b8a77fa"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44bad"},"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters. Films that fall into drama sub-genres include historical drama or costume drama, romantic drama, teen drama, medical drama, docudrama, film noir, and neo-noir.","Movies":[{"$oid":"6360112673c203b32b8a77fa"},{"$oid":"6360104d73c203b32b8a77f4"},{"$oid":"635ead68a6b13018ce5d9b3b"},{"$oid":"63596e55b2e4e7109ac44bbc"},{"$oid":"63596e55b2e4e7109ac44bb8"},{"$oid":"63596e55b2e4e7109ac44bb7"},{"$oid":"63596e55b2e4e7109ac44bb6"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44bae"},"Name":"Musical","Description":"Musical films weave songs or musical numbers into the narrative to progress the story or further develop the characters. Musicals are often tied to romance films but are not limited to that genre. Musical movies involve big stage-like productions, integrating necessary premises or character elements into the sequences.","Movies":[{"$oid":"6360112673c203b32b8a77fa"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44baf"},"Name":"Biography","Description":"A biopic (short for 'biographical picture') is a type of motion picture that tells the life story of a non-fictional, real person. Biopic films typically revolve around a historical figure or a famous person, though they can be about anyone—as long as the person actually exists or existed in real life.","Movies":[{"$oid":"635ead68a6b13018ce5d9b3b"},{"$oid":"63596e55b2e4e7109ac44bb6"}]}
{"_id":{"$oid":"635964e5b2e4e7109ac44bb0"},"Name":"Documentary","Description":"A documentary film or documentary is a non-fictional motion-picture intended to 'document reality, primarily for the purposes of instruction, education or maintaining a historical record'. The american film critic Bill Nichols has characterized the documentary in terms of 'a filmmaking practice, a cinematic tradition, and mode of audience reception (that remains) a practice without clear boundaries'.Documentaries are very informative, and are often used within schools as a resource to teach various principles. Documentary filmmakers have a responsibility to be truthful to their vision of the world without intentionally misrepresenting a topic.","Movies":[{"$oid":"63596e55b2e4e7109ac44bba"},{"$oid":"63596e55b2e4e7109ac44bb9"}]}
